bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
// Хостовый самотест подсистемы CORE в mk_math.
//
// Собирает настоящее ядро МК-61 (mk61emu_core.cpp) вместе с математической
// подсистемой CORE (mk_math_core.cpp) и проверяет совпадение всех трансцендентных
// функций с libm в пределах 8-разрядной точности калькулятора, работу pow(),
// согласованность чистых вспомогательных функций без libm с <math.h> и
// неизменность рабочего пользовательского состояния при аренде ядра.

#include <cmath>
#include <climits>
#include <cstdio>
#include <cstdlib>
#include <cstring>
#include <limits>

#include "mk_math.hpp"       // MK61_MATH_BACKEND == CORE (задаётся через -D)
#include "mk61emu_core.h"
#include "language_workspace.hpp"
#include "shared_memory.hpp"
#include "workspace_swap.hpp"

static int g_failures = 0;

#if MK61_CORE_BODY_PROFILE
struct RankedBody {
  core_61::RomChip chip;
  u8 region;
  u8 microprogram;
  u64 calls;
};

static const char* body_chip_name(core_61::RomChip chip) {
  switch(chip) {
    case core_61::RomChip::IK1302: return "IK02";
    case core_61::RomChip::IK1303: return "IK03";
    case core_61::RomChip::IK1306: return "IK06";
  }
  return "IK??";
}

static void dump_body_profile(void) {
  static constexpr usize TOP_COUNT = 32;
  RankedBody top[TOP_COUNT] = {};
  usize distinct = 0;
  bool rom_bodies[3][core_61::BODY_PROFILE_REGION_COUNT]
                 [core_61::BODY_PROFILE_MICROPROGRAM_COUNT] = {};

  for(u8 chip = 0; chip < 3; chip++) {
    for(usize address = 0; address < 256; address++) {
      const u32 instruction = core_61::rom_command_instruction(
          (core_61::RomChip) chip, (u8) address);
      const u8 body[3] = {
        (u8) instruction,
        (u8) (instruction >> 8),
        (u8) ((u8) (instruction >> 16) > 0x1FU
            ? 0x5FU : (u8) (instruction >> 16))
      };
      for(u8 region = 0; region < 3; region++) {
        if(body[region] < core_61::BODY_PROFILE_MICROPROGRAM_COUNT)
          rom_bodies[chip][region][body[region]] = true;
      }
    }
  }

  usize rom_distinct = 0;
  for(u8 chip = 0; chip < 3; chip++) {
    for(u8 region = 0; region < 3; region++) {
      for(u8 body = 0;
          body < core_61::BODY_PROFILE_MICROPROGRAM_COUNT; body++) {
        if(rom_bodies[chip][region][body]) rom_distinct++;
      }
    }
  }

  for(u8 chip = 0; chip < 3; chip++) {
    for(u8 region = 0; region < core_61::BODY_PROFILE_REGION_COUNT;
        region++) {
      for(u8 microprogram = 0;
          microprogram < core_61::BODY_PROFILE_MICROPROGRAM_COUNT;
          microprogram++) {
        const u64 calls = core_61::body_profile_count(
            (core_61::RomChip) chip, region, microprogram);
        if(calls == 0) continue;
        distinct++;
        for(usize position = 0; position < TOP_COUNT; position++) {
          if(calls <= top[position].calls) continue;
          for(usize move = TOP_COUNT - 1; move > position; move--)
            top[move] = top[move - 1];
          top[position] = {
              (core_61::RomChip) chip, region, microprogram, calls};
          break;
        }
      }
    }
  }

  const u64 total = core_61::body_profile_total();
  std::printf(
      "core body profile: total=%llu observed=%lu rom_distinct=%lu\n",
      (unsigned long long) total, (unsigned long) distinct,
      (unsigned long) rom_distinct);
  u64 cumulative = 0;
  usize bodies_for_90_percent = 0;
  for(usize rank = 0; rank < TOP_COUNT && top[rank].calls != 0; rank++) {
    cumulative += top[rank].calls;
    const double coverage = total == 0
        ? 0.0 : 100.0 * (double) cumulative / (double) total;
    std::printf("  %2lu %-4s r%u mp=%02X calls=%llu cumulative=%6.2f%%\n",
        (unsigned long) (rank + 1), body_chip_name(top[rank].chip),
        (unsigned) (top[rank].region + 1),
        (unsigned) top[rank].microprogram,
        (unsigned long long) top[rank].calls, coverage);
    if(bodies_for_90_percent == 0 && coverage >= 90.0)
      bodies_for_90_percent = rank + 1;
  }
  std::printf("  bodies_for_90_percent=%lu\n",
      (unsigned long) bodies_for_90_percent);
}
#endif

static void check_near(const char* label, double got, double want, double tol) {
  const double diff = std::fabs(got - want);
  const double scale = std::fabs(want) > 1.0 ? std::fabs(want) : 1.0;
  if(!std::isfinite(got) || !std::isfinite(want) ||
     diff > tol * scale) {
    std::printf("  FAIL %-14s got=%.10g want=%.10g diff=%.3g\n", label, got, want, diff);
    g_failures++;
  } else {
    std::printf("  ok   %-14s got=%.10g want=%.10g\n", label, got, want);
  }
}

static void check_true(const char* label, bool cond) {
  if(!cond) {
    std::printf("  FAIL %s\n", label);
    g_failures++;
  } else {
    std::printf("  ok   %s\n", label);
  }
}

static const char SYMBOLS[16] = {
    '0','1','2','3','4','5','6','7','8','9','-',' ',' ',' ',' ',' '
};

// Читает любой рабочий регистр стека так же, как интерпретаторы читают X.
static double read_live_reg(stack reg) {
  char value[15];
  value[14] = 0;
  read_stack_register(reg, value, SYMBOLS);

  char buffer[24];
  char* out = buffer;
  if(value[0] == '-') *out++ = '-';
  for(int i = 1; i <= 9; i++) {
    if(value[i] == ' ') continue;
    *out++ = value[i];
  }
  *out++ = 'e';
  *out++ = (value[11] == '-') ? '-' : '+';
  *out++ = value[12];
  *out++ = value[13];
  *out = 0;
  return mk_math::atof(buffer);
}

static double read_live_x(void) { return read_live_reg(stack::X); }

struct MatrixKey { int x, y; };

struct RomHookProbe {
  int calls;
  u8 last_address;
  u8 last_replacement;
  u8 replacement;
  bool replace;
  bool arrays_present;
};

struct CommandHookProbe {
  int calls;
  core_61::Mk61CommandHookPhase last_phase;
  core_61::Mk61CommandSource last_source;
  u8 last_opcode;
  u8 last_replacement;
  u32 last_sequence;
  bool replace;
  u8 replacement;
  bool override_x;
  bool try_nested_registration;
  core_61::Mk61CommandHookHandle nested_registration;
  int order_tag;
  int* order_log;
  int* order_count;
};

struct ProgramBoundaryProbe {
  int calls;
  u8 target;
  u8 last_address;
  u8 last_opcode;
  bool yield;
  u8 addresses[16];
  u8 opcodes[16];
};

static bool program_boundary_probe(
    const core_61::Mk61ProgramBoundaryContext& context, void* user_data) {
  ProgramBoundaryProbe* const probe = (ProgramBoundaryProbe*) user_data;
  if(probe->calls < (int) (sizeof(probe->addresses) / sizeof(probe->addresses[0]))) {
    probe->addresses[probe->calls] = context.address;
    probe->opcodes[probe->calls] = context.opcode;
  }
  probe->calls++;
  probe->last_address = context.address;
  probe->last_opcode = context.opcode;
  return probe->yield && context.address == probe->target;
}

