bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
  const char* endp = nullptr;
  check_near("atof int", mk_math::atof("123"), 123.0, 1e-9);
  check_near("atof frac", mk_math::atof("3.14159"), 3.14159, 1e-9);
  check_near("atof sci", mk_math::atof("-1.5e3"), -1500.0, 1e-9);
  check_near("atof huge int", mk_math::atof("123456789012345678901"), 1.2345678901234568e20, 1e-15);
  check_near("atof leading 0", mk_math::atof("0.00000000000000000000125"), 1.25e-21, 1e-15);
  check_true("atof overflow", mk_math::is_inf(mk_math::atof("1e999999")));
  check_true("atof underflow", mk_math::atof("1e-999999") == 0.0);
  check_true("atof zero huge", mk_math::atof("0e999999") == 0.0);
  double v = mk_math::strtod("42.5abc", &endp);
  check_near("strtod value", v, 42.5, 1e-9);
  check_true("strtod endptr", endp != nullptr && *endp == 'a');
  check_true("trunc NaN", mk_math::is_nan(mk_math::trunc(__builtin_nan(""))));
  check_true("floor +Inf", mk_math::is_inf(mk_math::floor(__builtin_huge_val())));
  check_true("pow10 subnormal", mk_math::pow10_int(-309) > 0.0);
  check_true("log10 invalid", mk_math::log10_floor(0.0) == 0);

  const char* huge_end = nullptr;
  const double huge = mk_math::strtod("1e999999999999999999999", &huge_end);
  check_true("strtod huge", std::isinf(huge));
  check_true("strtod huge end", huge_end != nullptr && *huge_end == 0);
  check_true("strtod zero huge", mk_math::atof("0e999999999999999999999") == 0.0);
  check_true("strtod denormal", mk_math::atof("4.940656458e-324") == std::numeric_limits<double>::denorm_min());
  check_near("strtod 20 digits", mk_math::strtod("12345678901234567890", nullptr), 1.2345678901234567e19, 1e-15);
  check_near("strtod long fraction", mk_math::atof("0.1234567890123456789012345"),
             0.12345678901234568, 1e-15);
}

static void test_transcendental(void) {
  std::printf("CORE transcendental vs libm (tol 1e-6):\n");
  const double tol = 1e-6;

  // The Flash-only test build does not run the SRAM-cache test which happens
  // to initialize the calculator.  Keep this test independent from build
  // options: eval_unary() deliberately refuses to snapshot an uninitialized
  // core whose internal table/ring pointers are still null.
  core_61::enable();

  check_near("sin(1)",   mk_math::sin(1.0),   std::sin(1.0),   tol);
  check_near("sin(-0.7)",mk_math::sin(-0.7),  std::sin(-0.7),  tol);
  check_near("cos(1)",   mk_math::cos(1.0),   std::cos(1.0),   tol);
  check_near("cos(2)",   mk_math::cos(2.0),   std::cos(2.0),   tol);
  check_near("tan(0.5)", mk_math::tan(0.5),   std::tan(0.5),   tol);
  check_near("asin(.5)", mk_math::asin(0.5),  std::asin(0.5),  tol);
  check_near("acos(.5)", mk_math::acos(0.5),  std::acos(0.5),  tol);
  check_near("atan(.5)", mk_math::atan(0.5),  std::atan(0.5),  tol);
  check_near("ln(2)",    mk_math::ln(2.0),    std::log(2.0),   tol);
  check_near("ln(10)",   mk_math::ln(10.0),   std::log(10.0),  tol);
  check_near("log10(100)",mk_math::log10(100.0), std::log10(100.0), tol);
  check_near("exp(1)",   mk_math::exp(1.0),   std::exp(1.0),   tol);
  check_near("exp(-2)",  mk_math::exp(-2.0),  std::exp(-2.0),  tol);
  check_near("sqrt(2)",  mk_math::sqrt(2.0),  std::sqrt(2.0),  tol);
  check_near("sqrt(1024)",mk_math::sqrt(1024.0), 32.0,         tol);

  check_near("pow(2,10)", mk_math::pow(2.0, 10.0), 1024.0,      tol);
  check_near("pow(1.5,3)",mk_math::pow(1.5, 3.0),  std::pow(1.5, 3.0), tol);
  check_near("pow(4,0.5)",mk_math::pow(4.0, 0.5),  2.0,         tol);
  check_near("pow(x,0)",  mk_math::pow(7.0, 0.0),  1.0,         tol);
  check_near("pow(-2,3)", mk_math::pow(-2.0, 3.0), -8.0,        tol);

  check_true("sqrt domain", mk_math::is_nan(mk_math::sqrt(-4.0)));
  check_true("ln domain", mk_math::is_nan(mk_math::ln(-1.0)));
  check_true("asin domain", mk_math::is_nan(mk_math::asin(2.0)));
  check_true("input overflow", mk_math::is_nan(mk_math::sin(1e100)));
  check_true("non-finite input", mk_math::is_nan(mk_math::cos(__builtin_huge_val())));
}

static void test_authentic_core_smoke(void) {
  std::printf("authentic ROM/core arithmetic smoke:\n");
  core_61::set_expanded_program_mode(false);
  core_61::enable();
  MK61Emu_SetAngleUnit(DEGREE);

  const MatrixKey key_2 = {4, 1};
  const MatrixKey key_3 = {5, 1};
  const MatrixKey key_enter = {11, 8};
  const MatrixKey key_add = {2, 8};
  press_matrix(key_2);
  press_matrix(key_enter);
  press_matrix(key_3);
  press_matrix(key_add);
  check_near("2 ENTER 3 +", read_live_x(), 5.0, 1e-8);
}

static double first_random(bool enhanced, u32 seed) {
  const MatrixKey key_k = {10, 9};
  const MatrixKey key_bx = {11, 8};
  core_61::configure_random_seed(enhanced, seed);
  core_61::enable();
  press_matrix(key_k);
  press_matrix(key_bx);
  return read_live_x();
}

static double next_random(void) {
  press_matrix({10, 9});
  press_matrix({11, 8});
  return read_live_x();
}

static void test_random_seed_hook(void) {
  std::printf("calculator random seed hook:\n");

  const double authentic_a = first_random(false, 1234567);
  const double authentic_b = first_random(false, 7654321);
  check_near("MK61 repeat", authentic_a, authentic_b, 0.0);

  const double enhanced_a = first_random(true, 1234567);
  const double enhanced_b = first_random(true, 7654321);
  check_true("seed changes RNG", std::fabs(enhanced_a - enhanced_b) > 1e-8);
  check_true("RNG in [0,1)", enhanced_a >= 0.0 && enhanced_a < 1.0 &&
                                  enhanced_b >= 0.0 && enhanced_b < 1.0);

  core_61::configure_random_seed(true, 2468135);
  core_61::enable();
  check_true("enhanced mode enabled", core_61::random_seed_enabled());
  press_matrix({4, 1}); // обычная клавиша 2 не должна раскрывать скрытый поток
  check_near("ordinary key unchanged", read_live_x(), 2.0, 1e-8);

  // Математический вызов CORE арендует и внутренне сбрасывает эмулятор. Его
  // снимок должен также сохранять позицию внешнего потока.
  core_61::configure_random_seed(true, 11223344);
  core_61::enable();
  const double before_math = next_random();
  (void) mk_math::sin(1.0);
  const double after_math = next_random();

  core_61::configure_random_seed(true, 11223344);
  core_61::enable();
  const double reference_first = next_random();
  const double reference_second = next_random();
  check_near("math keeps RNG first", before_math, reference_first, 0.0);
  check_near("math keeps RNG stream", after_math, reference_second, 0.0);

